/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   export.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: toshota <toshota@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/11/20 11:39:21 by toshota           #+#    #+#             */
/*   Updated: 2023/11/26 10:46:20 by toshota          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "builtin.h"

// 引数なし
int	exec_export(char **cmd, t_env **env)
{
	if(cmd[1])
	{
		;
	}
	else
	{
		/* 引数が指定されていない場合，環境変数を一覧表示する */
		// 環境変数を昇順(a→z)にする（push_swap!）
		// それぞれの環境変数の前に"declare -x "をつける
		// =の直後（変数名=""の形で表示する）
		;
	}

	return (true);
}
